package com.ddemyanov.javase04.t04;

import java.io.Serializable;

/**
 * Дана коллекция фильмов, содержащая информацию об актерах,
 * снимавшихся в главных ролях(один актер мог сниматься в нескольких фильмах).
 * Необходимо написать приложение, позволяющее при запуске восстанавливать коллекцию фильмов, позволяя ее
 * модифицировать, а по завершению работы - сохранять в файл.
 * Для восстановления/сохранения использовать сериализацию/десериализацию.
 */

public class FIlmCollection implements Serializable {}
